src/resources/API/SOAP/SearchDocument.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://intercom.eg">
   <soapenv:Header/>
   <soapenv:Body>
      <int:search soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <caseID xsi:type="xsd:string">{caseID}</caseID>
         <documentClassName xsi:type="xsd:string">{documentClassName}</documentClassName>
         <objectStore xsi:type="xsd:string">{objectStore}</objectStore>
         <username xsi:type="xsd:string">{userName}</username>
         <password xsi:type="xsd:string">{password}</password>
      </int:search>
   </soapenv:Body>
</soapenv:Envelope>
